DataFrame

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
column = ['D', 'E', 'F']

df = pd.DataFrame(data=data, index= ['A', 'B', 'C'], columns=column)
df

   D  E  F
A  1  2  3
B  4  5  6
C  7  8  9

In [3]:
# DataFrame 생성

data = {
        "country": ['kor', 'usa', 'china', 'japan'],
        "rank": [1, 2, 3, 4],
        'grade' : ["A", "B", "C", "D"]
        }
#print(data)
df = pd.DataFrame(data)
df

  country  rank grade
0     kor     1     A
1     usa     2     B
2   china     3     C
3   japan     4     D

In [4]:
# (1) DataFrame 생성시 인덱스 지정
df = pd.DataFrame(data, index = ['A', 'B', 'C', 'D'])
df

  country  rank grade
A     kor     1     A
B     usa     2     B
C   china     3     C
D   japan     4     D

In [5]:
# (2) df.index로 인덱스 지정
df.index = ['A', 'B', 'C', 'D']
df

  country  rank grade
A     kor     1     A
B     usa     2     B
C   china     3     C
D   japan     4     D

# (3) df.set_index로 인덱스 지정
df = df.set_index('grade')
df = df.set_index(['grade', 'rank'])
df

데이터 셀렉션
DataFrame에서 값을 불러오는 방법

1. []
ex)df.컬럼, df.['컬럼'], df[1:3]

2. loc[인덱스명, 컬럼명] #명칭(label) 기반 인덱싱

### 데이터 셀렉션

DataFrame에서 값을 불러오는 방법

1. []
ex)df.컬럼, df.['컬럼'], df[1:3]

2. loc[인덱스명, 컬럼명] #명칭(label) 기반 인덱싱

 label이나 boolean array로 인덱싱하는 방법
 사람이 읽을 수 있는 라벨 값으로 특정 값들을 골라오는 방법
  
3. iloc[인덱스, 컬럼인덱스] #위치(position) 기반 인덱싱

In [10]:
# DataFrame 생성

data = {
        "country": ['kor', 'usa', 'china', 'japan'],
        "rank": [1, 2, 3, 4],
        'grade' : ["A", "B", "C", "D"]
        }
#print(data)
df = pd.DataFrame(data)
df

  country  rank grade
0     kor     1     A
1     usa     2     B
2   china     3     C
3   japan     4     D

In [7]:
# (1) df.컬럼, df['컬럼']

## 하나의 컬럼 조회
df.country

A      kor
B      usa
C    china
D    japan
Name: country, dtype: object

In [8]:
df[['country', 'grade']]  # 2개 이상 컬럼 조회 []리스트로 감싸기

  country grade
A     kor     A
B     usa     B
C   china     C
D   japan     D

In [11]:
# (2) loc[인덱스명, 컬럼명]

## 인덱스 값이 0인 행 조회
df.loc[0]

country    kor
rank         1
grade        A
Name: 0, dtype: object

In [12]:
## 2개 이상의 행 조회
df.loc[0:2]

  country  rank grade
0     kor     1     A
1     usa     2     B
2   china     3     C

In [13]:
df.loc[[0,2]]  # []활용하여 인덱스 값 0, 2행 가져오기

  country  rank grade
0     kor     1     A
2   china     3     C

In [14]:
df.loc[0, 'grade']  #행과 열의 좌표. 0번째 행, 'grade'컬럼 추출

'A'

In [15]:
df.loc[0:2, ['country', 'grade']]

  country grade
0     kor     A
1     usa     B
2   china     C

In [16]:
df.loc[(df['grade']=='A') | (df['rank'] > 2)]  # 2개 컬럼 이상, 2개 조건 이상 추출

  country  rank grade
0     kor     1     A
2   china     3     C
3   japan     4     D

In [18]:
df[(df['country'] == 'usa') | (df['country'] == 'kor')]

  country  rank grade
0     kor     1     A
1     usa     2     B

In [19]:
df[df['rank']>2]

  country  rank grade
2   china     3     C
3   japan     4     D

In [20]:
# (3) iloc[인덱스, 컬럼인덱스] - 위치(location) 기반

# df2 = pd.DataFrame(data, index = ['A', 'B', 'C', 'D'])
# df2.loc[0]

df.loc[0] #전체 데이터 프레임에서 인덱스 이름이 0인 행 데이터 추출

country    kor
rank         1
grade        A
Name: 0, dtype: object

In [24]:
# df.iloc[2] # 3행의 데이터 # 전체 데이터 프레임에서 0번째 행 데이터 추출

df.loc[0:2]  #인덱스 값
df.iloc[0:2] #행의 범위가 들어온다.

  country  rank grade
0     kor     1     A
1     usa     2     B

In [30]:
df.loc[0:3]  #index 번호 0 ~ 3까지 추출

  country  rank grade
0     kor     1     A
1     usa     2     B
2   china     3     C
3   japan     4     D

In [26]:
df.iloc[0:2]

  country  rank grade
0     kor     1     A
1     usa     2     B

In [27]:
df.iloc[0:3, 0:2]  #[행, 열] 추출 # iloc는 무조건 정수 기반

  country  rank
0     kor     1
1     usa     2
2   china     3

In [28]:
df.iloc[0:3, 'rank']  # [행, 열] #iloc는 무조건 정수 기반

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [37]:
df.loc[(['country'] == 'kor') | df(['country'] == 'jap')]

TypeError: 'DataFrame' object is not callable

In [45]:
df.loc[[0,2],[1,2]]

KeyError: "None of [Int64Index([1, 2], dtype='int64')] are in the [columns]"

# filter()를 이용한 검색

In [48]:
df.filter

<bound method NDFrame.filter of   country  rank grade
0     kor     1     A
1     usa     2     B
2   china     3     C
3   japan     4     D>

In [49]:
df.filter(items = ['country', 'rank', 'item1', 'item2'])

  country  rank
0     kor     1
1     usa     2
2   china     3
3   japan     4

In [56]:
df.filter(like = 'c',axis = 1)  # 컬럼명에 c가 포함된 출력 /  axis = 0으로 바꾸면 인덱스에서 검색

  country
0     kor
1     usa
2   china
3   japan

In [57]:
df.filter(like = 'c', axis  = 0) #인덱스에 c가 들어가는 값 검색

Empty DataFrame
Columns: [country, rank, grade]
Index: []

In [58]:
df.filter(like = 'r', axis = 1) # 컬럼명에 r이 포함된 출력

  country  rank grade
0     kor     1     A
1     usa     2     B
2   china     3     C
3   japan     4     D

# 2. 데이터 추가 및 삭제
DataFrame 추가

In [105]:
# DataFrame 생성

data = {
        "country": ['kor', 'usa', 'china', 'japan'],
        "rank": [1, 2, 3, 4],
        'grade' : ["A", "B", "C", "D"]
        }
#print(data)
df = pd.DataFrame(data)
df

  country  rank grade
0     kor     1     A
1     usa     2     B
2   china     3     C
3   japan     4     D

In [106]:
## (1) Series를 이용하여 열 데이터 추가
president = pd.Series(['yoon', 'biden', 'kishida', 'jinping'], index = [0, 1, 2, 3]) #열 데이터 생성
president
df['president'] = president  # 열 합치기
df

  country  rank grade president
0     kor     1     A      yoon
1     usa     2     B     biden
2   china     3     C   kishida
3   japan     4     D   jinping

In [111]:
## (2) Numpy를 이용하여 열 데이터 추가
import numpy as np
gdp = pd.Series([0, 0, 0, 0], index = [0, 1, 2, 3]) # 4개 열 데이터 생성
add = np.zeros(4).astype(int)  #Numpy로 4개의 열 데이터 생성
df['etc'] = add
df

   index country  rank grade president  new_grade  etc
0      0     kor     1     A      yoon       True    0
1      1     usa     2     B     biden       True    0
2      2   china     3     C   kishida      False    0
3      3   japan     4     D   jinping      False    0

In [112]:
## (3) 연산을 이용하여 열 데이터 추가

df['rank'] < 3
df['new_grade'] = df['rank'] < 3
df

   index country  rank grade president  new_grade  etc
0      0     kor     1     A      yoon       True    0
1      1     usa     2     B     biden       True    0
2      2   china     3     C   kishida      False    0
3      3   japan     4     D   jinping      False    0

In [109]:
## (4) loc()를 이용하여 행 데이터 추가

df.loc[3] = ['singapole', 4, 'D', 'jao', 0, False]
df

ValueError: Must have equal len keys and value when setting with an iterable

In [110]:
df = df.reset_index()  # index 정렬
df

   index country  rank grade president  new_grade
0      0     kor     1     A      yoon       True
1      1     usa     2     B     biden       True
2      2   china     3     C   kishida      False
3      3   japan     4     D   jinping      False

# DataFrame 삭제

In [100]:
## (1) drop
### 행 삭제
df
df = df.drop(index = 4)  # 원본은 삭제가 되지 않음.

KeyError: '[4] not found in axis'

In [113]:
df  #원본 살아있음

   index country  rank grade president  new_grade  etc
0      0     kor     1     A      yoon       True    0
1      1     usa     2     B     biden       True    0
2      2   china     3     C   kishida      False    0
3      3   japan     4     D   jinping      False    0

In [114]:
df = df.drop(index = 3, inplace = True) # 원본 실제 삭제

In [118]:
### 열 삭제
df.drop('new_grade', axis = 1, inplace = True) # axis = 0이면 인덱스, axis=1이면 컬럼

AttributeError: 'NoneType' object has no attribute 'drop'

In [116]:
## (2) del
### 열 삭제
del df['gdp']
df

TypeError: 'NoneType' object does not support item deletion

# Pandas 퀴즈

다음은 대한민국 여화 중에서 관객 수가 가장 맣ㄴ은 상위 8개의 데이터입니다. 주어진 코드를 이용하여 퀴즈를 풀어보시오.

In [140]:
import pandas as pd

data = {
        '영화': ['명량', '극한직업', '신과함께', '국제시장', '괴물', '도둑들', '7번방의 선물', '암살'],
        '개봉연도': [2014, 2019, 2017, 2014, 2006, 2012, 2013, 2015],
        '관객 수' : [1761, 1626, 1441, 1426, 1301, 1298, 1281, 1270],
        '평점': [8.88, 9.20, 8.73, 9.16, 8.62, 7.64, 8.83, 9.10]
}

df = pd.DataFrame(data)
df

        영화  개봉연도  관객 수    평점
0       명량  2014  1761  8.88
1     극한직업  2019  1626  9.20
2     신과함께  2017  1441  8.73
3     국제시장  2014  1426  9.16
4       괴물  2006  1301  8.62
5      도둑들  2012  1298  7.64
6  7번방의 선물  2013  1281  8.83
7       암살  2015  1270  9.10

1) 전체 데이터 중에서 '영화' 정보만 출력

In [151]:
df['영화']
# df.loc[:7, '영화']

0         명량
1       극한직업
2       신과함께
3       국제시장
4         괴물
5        도둑들
6    7번방의 선물
7         암살
Name: 영화, dtype: object

2) 전체 데이터 중에서 '영화', '평점' 정보를 출력하시오.

In [154]:
df[['영화','평점']]
# df.loc[:7, ['영화', '평점']]

        영화    평점
0       명량  8.88
1     극한직업  9.20
2     신과함께  8.73
3     국제시장  9.16
4       괴물  8.62
5      도둑들  7.64
6  7번방의 선물  8.83
7       암살  9.10

3) 2015년 이후에 개봉한 영화 데이터 중에서 '영화', '개봉연도', 정보를 출력하시오.

In [161]:
# df[df['개봉연도'] > 2015][['영화', '개봉연도']]

df.loc[(df['개봉연도'] > 2015) & (df['영화'])]

# a = df['개봉연도'] > 2015
# df.loc[a, ['영화', '개봉연도']]

     영화  개봉연도
1  극한직업  2019
2  신과함께  2017

4) 주어진 계산식을 참고하여 '추천 점수' Column을 추가하시오.
추천 점수 = (관객수*평점)/100
tip.
1) 추천 점수 series를 만들자.
2) 추천 점수 series를 추가해주자.

In [162]:
df['추천점수'] = (df['관객 수'] * df['평점'])//100
df

        영화  개봉연도  관객 수    평점   추천점수
0       명량  2014  1761  8.88  156.0
1     극한직업  2019  1626  9.20  149.0
2     신과함께  2017  1441  8.73  125.0
3     국제시장  2014  1426  9.16  130.0
4       괴물  2006  1301  8.62  112.0
5      도둑들  2012  1298  7.64   99.0
6  7번방의 선물  2013  1281  8.83  113.0
7       암살  2015  1270  9.10  115.0

5) 전체 데이터를 '개봉연도' 기준 내림차순으로 출력하시오.

In [146]:
df.sort_values('개봉연도', ascending=False)  #sort_values 오름/내림차순 정렬. 기본값 > 오름차순. ascending = False 내림차순 정렬.

        영화  개봉연도  관객 수    평점      추천점수
1     극한직업  2019  1626  9.20  149.5920
2     신과함께  2017  1441  8.73  125.7993
7       암살  2015  1270  9.10  115.5700
0       명량  2014  1761  8.88  156.3768
3     국제시장  2014  1426  9.16  130.6216
6  7번방의 선물  2013  1281  8.83  113.1123
5      도둑들  2012  1298  7.64   99.1672
4       괴물  2006  1301  8.62  112.1462

# 3. 집합(aggregation) 함수
- df.sum()
- df.mean()
- df.max()
- df.describe()
    - count: 총 개수
    - mean_ 평균
    - std: 표준편차
    - min: 최소값
    - 25%: 1/4
    - 50%: 2/4
    - 75%: 3/4
    - max: 최대값

In [174]:
# DataFrame 생성

data = {
        "country": ['kor', 'usa', 'china', 'japan'],
        "rank": [1, 2, 3, 4],
        'grade' : ["A", "B", "C", "D"],
        'score' : [100, 80, 60, 40]
        }
#print(data)
df = pd.DataFrame(data)
df

  country  rank grade  score
0     kor     1     A    100
1     usa     2     B     80
2   china     3     C     60
3   japan     4     D     40

In [175]:
print(df.describe())

           rank       score
count  4.000000    4.000000
mean   2.500000   70.000000
std    1.290994   25.819889
min    1.000000   40.000000
25%    1.750000   55.000000
50%    2.500000   70.000000
75%    3.250000   85.000000
max    4.000000  100.000000

In [177]:
## 하나의 칼럼에 적용
df.score
df.score.mean()
df['score'].mean()
df.loc[:, 'score'].mean()  #[행,열] => 행 데이터는 다 가져오고, score 열값만 불러줘.
# df.iloc[:, 3].mean()

70.0

In [180]:
## 여러개의 칼럼에 적용
df[['rank', 'score']].sum(axis=0)  #axis =0, 가로측 중심 => 각 행을 모두 더한 값,

rank      10
score    280
dtype: int64

In [181]:
df[['rank', 'score']].sum(axis=1)  #axis =1, 세로축 중심 => 각행을 모두 더한 값.

0    101
1     82
2     63
3     44
dtype: int64

# 4. 정렬
- sort_index(), index 순서대로 정렬
- sort_values(by=['컬럼'], ascending=True), column의 value값대로 정렬 /오름차순(True), 내림차순(False)

In [2]:
# DataFrame 생성

data = {
        "country": ['kor', 'usa', 'china', 'japan'],
        "rank": [1, 2, 3, 4],
        'grade' : ["A", "B", "C", "D"],
        'score' : [100, 80, 60, 40]
        }
column = ['country', 'rank', 'grade', 'score']
df = pd.DataFrame(data, columns = column)
df

  country  rank grade  score
0     kor     1     A    100
1     usa     2     B     80
2   china     3     C     60
3   japan     4     D     40

In [3]:
## (1) sort_index()

df.sort_index()
df.sort_index(axis =0) # 인덱스 정렬
df.sort_index(axis =1) # 컬럼순 정렬
df.sort_index(axis =1, ascending=False) #컬럼을 내림차순으로 정렬

   score  rank grade country
0    100     1     A     kor
1     80     2     B     usa
2     60     3     C   china
3     40     4     D   japan

In [4]:
## (2) sort_values(by=['컬럼'])
# df.sort_values(by=['score']) # score 컬럼을 기준으로 오름차순 정렬
df.sort_values(by=['score'], ascending=False) #score칼럼을 기준으로 내림차순 정렬

  country  rank grade  score
0     kor     1     A    100
1     usa     2     B     80
2   china     3     C     60
3   japan     4     D     40

In [5]:
### 2개 이상의 컬럼값으로 정렬
df.sort_values(by=['country', 'score'])
# df.sort_values(by=['country', 'score'], ascending=[True,False])

  country  rank grade  score
2   china     3     C     60
3   japan     4     D     40
0     kor     1     A    100
1     usa     2     B     80

# Nan 데이터 처리하기
- Nan: Not a Number, null 데이터
- isnull() or isna(): 값이 null이면 True
- fillna(): null 데이터를 찾아 value로 지정된 값으로 변환
- dropna(): 행 데이터를 기준으로 null 값이 포함된 데이터 제거

1. Nan데이터를 분석 결과에 치명적인 영향을 줄 수 있다. 우선 Nan 데이터가 포함 여부 체크후 Nan 데이터를 어떻게 할 것인지

In [6]:
df['check'] = np.nan
df

  country  rank grade  score  check
0     kor     1     A    100    NaN
1     usa     2     B     80    NaN
2   china     3     C     60    NaN
3   japan     4     D     40    NaN

In [8]:
# df.isna()
df.isnull()

   country   rank  grade  score  check
0    False  False  False  False   True
1    False  False  False  False   True
2    False  False  False  False   True
3    False  False  False  False   True

## 2)fillna()

In [15]:
#Nan을 True로 채우기
df.fillna(value="채워")
df

  country  rank grade  score  check  chcek
0     kor     1     A    100    NaN    NaN
1     usa     2     B     80    NaN    NaN
2   china     3     C     60    NaN    NaN
3   japan     4     D     40    NaN    NaN

## 3) dropna()

In [18]:
# df.dropna(how='any')  # Nan이 포함된 행은 모두 제거
df
df.dropna(how='all')  # 행 전체가 Nan인 행 제거
df.dropna?

  country  rank grade  score  check  chcek
0     kor     1     A    100    NaN    NaN
1     usa     2     B     80    NaN    NaN
2   china     3     C     60    NaN    NaN
3   japan     4     D     40    NaN    NaN

# 6.데이터 타입 변환
- astype()
- to_numeric(), to_datetime(), to_timedelta()

In [20]:
# DataFrame 생성

data = {
        "country": ['kor', 'usa', 'china', 'japan'],
        "rank": [1, 2, 3, 4],
        'score' : [100, 80, 60, 40],
        'birth': ['1.1.2022', '2.1.2023', '3.1.2024', '4.1.2025'],
        'etc': ['1', '2', '3', '4']
        }
column = ['country', 'rank', 'grade', 'score', 'birth', 'etc']
df = pd.DataFrame(data, columns = column)
print(df)

  country  rank grade  score     birth etc
0     kor     1   NaN    100  1.1.2022   1
1     usa     2   NaN     80  2.1.2023   2
2   china     3   NaN     60  3.1.2024   3
3   japan     4   NaN     40  4.1.2025   4

## astype()

In [24]:
df.dtypes

## rank컬럼의 데이터 타입을 정수 => 실수형으로 변경
df['rank'].dtypes
df['rank'].astype('float')

0    1.0
1    2.0
2    3.0
3    4.0
Name: rank, dtype: float64

## to_numeric

In [25]:
df['etc'].dtypes  #dtype('0') ==> Object 즉, 문자열

dtype('O')

In [26]:
pd.to_numeric(df['etc'])  #문자열 형태를 적절한 타입 데이터로 변환

0    1
1    2
2    3
3    4
Name: etc, dtype: int64

## to_datetime

In [27]:
df['birth'].dtypes

dtype('O')

In [28]:
pd.to_datetime(df['birth'])

0   2022-01-01
1   2023-02-01
2   2024-03-01
3   2025-04-01
Name: birth, dtype: datetime64[ns]